#include "global.h"
#include "text.h"


/* Game Text - Mechanical Horse */


const char D_0805c3d4[] = "Ｒぎｅｓｓａｙｅｚ　ｌａ　ｌｅおｏｎ　１．";

const char D_0805c3f0[] = "Ｌｅおｏｎ　１　ｒぎｕｓｓｉｅ　！";

const char D_0805c40c[] = "Ｒぎｅｓｓａｙｅｚ　ｌａ　ｌｅおｏｎ　２．";

const char D_0805c428[] = "Ｌｅおｏｎ　２　ｒぎｕｓｓｉｅ　！";

const char D_0805c444[] = "Ｒぎｅｓｓａｙｅｚ　ｌａ　ｌｅおｏｎ　３．";

const char D_0805c460[] = "Ｌｅおｏｎ　３　ｒぎｕｓｓｉｅ　！";

const char D_0805c47c[] = "Ｒぎｅｓｓａｙｅｚ　ｌａ　ｌｅおｏｎ　４．";

const char D_0805c498[] = "Ｌｅおｏｎ　４　ｒぎｕｓｓｉｅ　！";

const char D_0805c4b4[] = "Ｓｕｉｖｅｚ　ｍｅｓ　ｐａｓ";

const char D_0805c4cc[] = "Ｕｔｉｌｉｓｅｚ　ｎ’ｉｍｐｏｒｔｅ　ｑｕｅｌ　ｂｏｕｔｏｎ";

const char D_0805c4e8[] = "Ｌｅおｏｎ　１　：　ｌｅ　ｐａｓ";

const char D_0805c504[] = "";

const char D_0805c508[] = "ＯＫ　！　Ｌｅおｏｎ　ｓｕｉｖａｎｔｅ　！";

const char D_0805c520[] = "Ｌｅおｏｎ　２　：　ｌｅ　ｔｒｏｔ";

const char D_0805c53c[] = "Ｌｅおｏｎ　３　：　ｌｅ　ｇａｌｏｐ";

const char D_0805c558[] = "ＯＫ　！　Ｄｅｒｎｉぐｒｅ　ｌｅおｏｎ　！";

const char D_0805c570[] = "Ｌｅおｏｎ　４　：　ｌｅ　ｇｒａｎｄ　ｇａｌｏｐ";

const char D_0805c58c[] = "ＯＫ，　ｂｏｎ　ｔｒａｖａｉｌ　！";

const char D_0805c5a4[] = "Ｒぎｅｓｓａｙｅｚ　ｌａ　ｌｅおｏｎ　１．";

const char D_0805c5c0[] = "Ｌｅおｏｎ　１　ｒぎｕｓｓｉｅ　！";

const char D_0805c5dc[] = "Ｒぎｅｓｓａｙｅｚ　ｌａ　ｌｅおｏｎ　２．";

const char D_0805c5f8[] = "Ｌｅおｏｎ　２　ｒぎｕｓｓｉｅ　！";

const char D_0805c614[] = "Ｒぎｅｓｓａｙｅｚ　ｌａ　ｌｅおｏｎ　３．";

const char D_0805c630[] = "Ｌｅおｏｎ　３　ｒぎｕｓｓｉｅ　！";

const char D_0805c64c[] = "Ｒぎｅｓｓａｙｅｚ　ｌａ　ｌｅおｏｎ　４．";

const char D_0805c668[] = "Ｌｅおｏｎ　４　ｒぎｕｓｓｉｅ　！";

const char D_0805c684[] = "Ｓｕｉｖｅｚ　ｍｅｓ　ｐａｓ";

const char D_0805c69c[] = "Ｕｔｉｌｉｓｅｚ　ｎ’ｉｍｐｏｒｔｅ　ｑｕｅｌ　ｂｏｕｔｏｎ";

const char D_0805c6b8[] = "Ｌｅおｏｎ　１　：　ｌｅ　ｐａｓ";

const char D_0805c6d4[] = "";

const char D_0805c6d8[] = "ＯＫ　！　Ｌｅおｏｎ　ｓｕｉｖａｎｔｅ　！";

const char D_0805c6f0[] = "Ｌｅおｏｎ　２　：　ｌｅ　ｔｒｏｔ";

const char D_0805c70c[] = "Ｌｅおｏｎ　３　：　ｌｅ　ｇａｌｏｐ";

const char D_0805c728[] = "ＯＫ　！　Ｄｅｒｎｉぐｒｅ　ｌｅおｏｎ　！";

const char D_0805c740[] = "Ｌｅおｏｎ　４　：　ｌｅ　ｇｒａｎｄ　ｇａｌｏｐ";

const char D_0805c75c[] = "ＯＫ　！　Ｖｏｕｓ　ｓｅｍｂｌｅｚ　ｐｒがｔ　！";
